app/Model/BookingRoom.php

select `st_room_id` from `manage_rooms` where `user_id` = 1
---
    public function scopeFilterByPermissionView($q)
    {
        /**
         *  ถ้า user ที่ login นี้ ได้ถูกเลือกเป็นผู้จัดการจองห้อง (Manage booking) ใน setting/st-room ให้แสดงเฉพาะการจองของห้องที่ถูกต้องค่าไว้ โดยไม่สนว่าจะเป็น access-self หรือ access-all
         */
        // ส่วนผู้จัดการจองห้อง
        $is_manageroom = ManageRoom::select('st_room_id')->where('user_id', Auth::user()->id)->get()->toArray();