app/Model/StProvince.php

select * from `st_bureaus` where `st_bureaus`.`code` = '06102048' and `st_bureaus`.`code` is not null limit 1
---
    public function scopeFilterByUserBureauProvince($q)
    {
        if (Auth::user()->bureau->st_province_code != 10 && Auth::user()->bureau->st_province_code != "") {
            return $q->where('code', Auth::user()->bureau->st_province_code);