app/Http/Controllers/Setting/PermissionGroupController.php

    public function index(Request $request)
    {
        // ตรวจสอบ permission
        ChkPerm('permission-group-view');

        $keyword = $request->get('search');
        $perPage = 10;

        $permissiongroup = PermissionGroup::withCount('stUser');

        if (!empty($keyword)) {
            $permissiongroup = $permissiongroup->where('name', 'LIKE', "%$keyword%");
        }

        $permissiongroup = $permissiongroup->paginate($perPage);
---
select * from `permission_groups` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `permission_groups`