app/Http/Controllers/Setting/StBossController.php

    public function index(Request $req)
    {
        // ตรวจสอบ permission
        ChkPerm('st-boss-view');

        $rs = StBoss::withCount('bookingBoss')->where(function ($q) use ($req) {
            if ($req->search) {
                $q->where('name', 'LIKE', "%$req->search%");
            }
        })->orderBy('order', 'asc')->paginate(999);
---
select count(*) as aggregate from `st_bosses`