app/Http/Controllers/Setting/StDriverController.php

select * from `st_drivers` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `st_drivers`
---
    public function index(Request $request)
    {
        // ตรวจสอบ permission
        ChkPerm('st-driver-view');

        $keyword = $request->get('search');
        $st_department_code = $request->get('st_department_code');
        $st_bureau_code = $request->get('st_bureau_code');
        $st_division_code = $request->get('st_division_code');
        $perPage = 10;

        $rs = StDriver::select('*');

        if (!empty($st_department_code)) {
            $rs = $rs->where('st_department_code', $st_department_code);
        }

        if (!empty($st_bureau_code)) {
            $rs = $rs->where('st_bureau_code', $st_bureau_code);
        }

        if (!empty($st_division_code)) {
            $rs = $rs->where('st_division_code', $st_division_code);
        }

        if (!empty($keyword)) {
            $rs = $rs->where('name', 'LIKE', "%$keyword%");
        }

        $rs = $rs->orderBy('id','desc')->paginate($perPage);