app/Http/Controllers/Setting/StPositionLevelController.php

    public function index(Request $req)
    {
        // ตรวจสอบ permission
        ChkPerm('st-position-level-view');

        $rs = StPositionLevel::withCount('stBoss')->where(function ($q) use ($req) {
            if ($req->search) {
                $q->where('name', 'LIKE', "%$req->search%");
            }
        })->orderBy('id', 'desc')->paginate(10);
---
select count(*) as aggregate from `st_position_levels`