app/Http/Controllers/Setting/StPositionMeetingController.php

select * from `st_position_meetings` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `st_position_meetings`
---
    public function index(Request $req)
    {
        // ตรวจสอบ permission
        ChkPerm('st-position-meeting-view');

        $rs = StPositionMeeting::withCount('bookingBoss')->where(function ($q) use ($req) {
            if ($req->search) {
                $q->where('name', 'LIKE', "%$req->search%");
            }
        })->orderBy('id', 'desc')->paginate(10);