app/Http/Controllers/Setting/StResourceController.php

select count(*) as aggregate from `st_resources`
---
    public function index(Request $request)
    {
        // ตรวจสอบ permission
        // ChkPerm('st-resource-view');

        $keyword = $request->get('search');

        $rs = StResource::select('*');

        if (!empty($keyword)) {
            $rs = $rs->where('name', 'LIKE', "%$keyword%");
        }

        /**
         * เห็นเฉพาะของตัวเอง ในกรณีที่สิทธิ์การใช้งานตั้งค่าไว้, default คือเห็นทั้งหมด
         */
        if (CanPerm('access-self')) {
            $rs = $rs->where('st_division_code',Auth::user()->st_division_code);
        }

        $rs = $rs->orderBy('id','desc')->paginate(10);