app/Http/Controllers/Setting/StRoomController.php

select * from `booking_rooms` where `booking_rooms`.`st_room_id` in (12, 13, 16, 17, 18, 19, 22, 23, 24, 25, 28, 35, 36, 37, 38, 39, 40, 41, 42, 43)
select * from `manage_rooms` where `manage_rooms`.`st_room_id` in (12, 13, 16, 17, 18, 19, 22, 23, 24, 25, 28, 35, 36, 37, 38, 39, 40, 41, 42, 43)
select * from `st_rooms` order by `order` asc limit 999 offset 0
select * from `users` where `users`.`id` in (68, 135)
---
    public function index(Request $request)
    {
        // ตรวจสอบ permission
        ChkPerm('st-room-view');

        $keyword = $request->get('search');

        $rs = StRoom::withCount('bookingRoom')->with('manageRoom.user');

        if (!empty($keyword)) {
            $rs = $rs->where('name', 'LIKE', "%$keyword%");
        }

        if ($request->st_province_code) {
            $rs = $rs->where('st_province_code', $request->st_province_code);
        }

        /**
         * เห็นเฉพาะของตัวเอง ในกรณีที่สิทธิ์การใช้งานตั้งค่าไว้, default คือเห็นทั้งหมด
         */
        if (CanPerm('access-self')) {
            $rs = $rs->where('st_division_code', Auth::user()->st_division_code);
        }

        $stroom = $rs->orderBy('order', 'asc')->paginate(999);