app/Http/Controllers/Setting/StVehicleTypeController.php

    public function index(Request $request)
    {
        // ตรวจสอบ permission
        ChkPerm('st-vehicle-type-view');

        $keyword = $request->get('search');
        $perPage = 10;

        $stvehicletype = StVehicleType::withCount('stVehicle');

        if (!empty($keyword)) {
            $stvehicletype = $stvehicletype->where('name', 'LIKE', "%$keyword%");
        }

        $stvehicletype = $stvehicletype->paginate($perPage);
---
select count(*) as aggregate from `st_vehicle_types`