app/Http/Controllers/Setting/StVehicleController.php

select count(*) as aggregate from `st_vehicles`
---
    public function index(Request $request)
    {
        // ตรวจสอบ permission
        ChkPerm('st-vehicle-view');

        $st_vehicle_type_id = $request->get('st_vehicle_type_id');
        $keyword = $request->get('search');

        $rs = StVehicle::withCount('bookingVehicle');

        if (!empty($st_vehicle_type_id)) {
            $rs = $rs->where('st_vehicle_type_id', $st_vehicle_type_id);
        }

        if (!empty($keyword)) {
            $rs = $rs->where('brand', 'LIKE', "%$keyword%");
        }

        /**
         * เห็นเฉพาะของตัวเอง ในกรณีที่สิทธิ์การใช้งานตั้งค่าไว้, default คือเห็นทั้งหมด
         */
        if (CanPerm('access-self')) {
            $rs = $rs->where('st_division_code', Auth::user()->st_division_code);
        }

        $rs = $rs->orderBy('id', 'desc')->paginate(10);