app/Helpers/HtmlHelpers.php

select * from `st_provinces` where `code` is null limit 1
---
    function getProviceName($id)
    {
        $rs = \App\Model\StProvince::where('code', $id)->first();