app/Helpers/PermissionHelpers.php

select * from `permissions` where `name` = 'access-self' and exists (select * from `permission_roles` where `permissions`.`id` = `permission_roles`.`permission_id` and `permission_group_id` = 3) limit 1
---
    function CanPerm($name = false)
    {
        // permission(plan-view);
        $rs = App\Model\Permission::where('name', $name)
            ->WhereHas('permission_roles', function ($q) {
                $q->where('permission_group_id', Auth::user()->permission_group_id);
            })->first();

select * from `permissions` where `name` = 'booking-room-view' and exists (select * from `permission_roles` where `permissions`.`id` = `permission_roles`.`permission_id` and `permission_group_id` = 3) limit 1
---
    function ChkPerm($name = false, $url_redirect = 'home')
    {
        // permission(plan-view);
        $rs = App\Model\Permission::where('name', $name)
            ->WhereHas('permission_roles', function ($q) {
                $q->where('permission_group_id', Auth::user()->permission_group_id);
            })->first();