app/Http/Controllers/AjaxController.php

    public function ajaxGetBureau(Request $req)
    {
        $data['rs'] = StBureau::where(function ($q) use ($req) {
            if ($req->st_department_code) {
                $q->where('code', 'LIKE', "%$req->st_department_code%");
            }
            if ($req->st_province_code) {
                $q->where('st_province_code', $req->st_province_code);
            }
        })->orderBy('code', 'asc')->get();
---
select * from `st_bureaus` where (`code` LIKE '%06102%') order by `code` asc

    public function ajaxGetDivision(Request $req)
    {
        $data['rs'] = StDivision::where(function ($q) use ($req) {
            if ($req->st_bureau_code) {
                $q->where('code', 'LIKE', "%$req->st_bureau_code%");
            }
            if ($req->st_province_code) {
                $q->where('st_province_code', $req->st_province_code);
            }
        })->orderBy('code', 'asc')->get();
---
select * from `st_divisions` where (`code` LIKE '%06102004%') order by `code` asc

    public function ajaxGetDivisionVehicle(Request $req)
    {
        // $data['rs'] = StVehicle::select('st_division_code')->where('st_bureau_code', 'like', $_GET['st_bureau_code'] . '%')->where('status', 'พร้อมใช้')->with('division')->distinct()->orderBy('st_division_code', 'asc')->get();

        $data['rs'] = StVehicle::select('st_division_code')->where(function ($q) use ($req) {
            $q->where('status', 'พร้อมใช้');

            if ($req->st_bureau_code) {
                $q->where('st_bureau_code', 'LIKE', "%$req->st_bureau_code%");
            }

            if ($req->st_province_code) {
                $q->where('st_province_code', $req->st_province_code);
            }
        })->with('division')->distinct()->orderBy('st_division_code', 'asc')->get();
---
select distinct `st_division_code` from `st_vehicles` where (`status` = 'พร้อมใช้' and `st_bureau_code` LIKE '%06102048%' and `st_province_code` = '12') order by `st_division_code` asc
select * from `st_bureaus` where `st_bureaus`.`code` in ('06102004', '06102007', '06102008', '06102011')
select * from `st_divisions` where `st_divisions`.`code` in ('06102048001')
select * from `st_divisions` where `st_divisions`.`code` in ('06102004001', '06102007004', '06102008001', '06102011001', '06102011002', '06102011003')

    public function ajaxGetRoom()
    {
        $rs = StRoom::with('department', 'bureau', 'division')->select('*')->where('status', '1');

        /**
         * เห็นเฉพาะของตัวเอง ในกรณีที่สิทธิ์การใช้งานตั้งค่าไว้, default คือเห็นทั้งหมด
         */
        if (!Auth::guest()) {
            if (CanPerm('access-self')) {
                $rs = $rs->where('st_division_code', Auth::user()->st_division_code);
            }
        }

        if (!empty($_GET['search'])) {
            $rs = $rs->where('name', 'like', '%' . $_GET['search'] . '%');
        }

        if (!empty($_GET['depertment_code'])) {
            $rs = $rs->where('st_department_code', $_GET['depertment_code']);
        }

        if (!empty($_GET['bureau_code'])) {
            $rs = $rs->where('st_bureau_code', $_GET['bureau_code']);
        }

        if (!empty($_GET['st_province_code'])) {
            $rs = $rs->where('st_province_code', $_GET['st_province_code']);
        }

        $rs = $rs->orderBy('id', 'asc')->get();
---
select * from `st_bureaus` where `st_bureaus`.`code` in ('06102004', '06102007', '06102008', '06102009', '06102011')
select * from `st_departments` where `st_departments`.`code` in ('06102')
select * from `st_divisions` where `st_divisions`.`code` in ('06102004001', '06102007004', '06102008001', '06102009002', '06102011001', '06102011002', '06102011003')
select * from `st_rooms` where `status` = '1' and `st_province_code` = '10' order by `id` asc

    public function ajaxGetRoomDetail()
    {
        $rs = StRoom::with('department', 'bureau', 'division')->find(@$_GET['st_room_id']);
---
select * from `st_rooms` where `st_rooms`.`id` = '13' limit 1

    public function ajaxRoomChkOverlap()
    {
        $st_room_id = $_GET['st_room_id'];
        $start_date = Date2DB($_GET['start_date']);
        $end_date = Date2DB($_GET['end_date']);
        $start_time = $_GET['start_time'];
        $end_time = $_GET['end_time'];
        $st_province_code = @$_GET['st_province_code'];
        $id = $_GET['id'];

        $rs = BookingRoom::select('*')->where('st_room_id', $st_room_id)
            ->where(function ($q) use ($start_date, $end_date) {
                $q->whereRaw('start_date <= ? and end_date >= ? or start_date <= ? and end_date >= ? ', [$start_date, $start_date, $end_date, $end_date]);
            })
            ->where(function ($q) use ($start_time, $end_time) {
                $q->whereRaw('start_time <= ? and end_time >= ? or start_time <= ? and end_time >= ? ', [$start_time, $start_time, $end_time, $end_time]);
            });

        if (!empty($st_province_code)) {
            $rs = $rs->where('st_province_code', $st_province_code);
        }

        if (!empty($id)) { // เช็กในกรณีแก้ไข ไม่ให้นับ row ของตัวเอง จะได้หาค่าที่เหลือมกับของคนอื่น
            $rs = $rs->where('id', '<>', $id);
        }

        $rs = $rs->get();
---
select * from `booking_rooms` where `st_room_id` = '13' and (start_date <= '2021-04-22' and end_date >= '2021-04-22' or start_date <= '2021-04-22' and end_date >= '2021-04-22' ) and (start_time <= '00:00' and end_time >= '00:00' or start_time <= '23:00' and end_time >= '23:00' ) and `st_province_code` = '10'

    public function ajaxBossChkOverlap()
    {
        $st_boss_id = $_GET['st_boss_id'];
        $start_date = Date2DB($_GET['start_date']);
        $end_date = Date2DB($_GET['end_date']);
        $start_time = $_GET['start_time'];
        $end_time = $_GET['end_time'];
        $id = $_GET['id'];

        $rs = BookingBoss::select('*')
            ->where('st_boss_id', $st_boss_id)
            ->where(function ($q) use ($start_date, $end_date) {
                $q->whereRaw('start_date <= ? and end_date >= ? or start_date <= ? and end_date >= ? ', [$start_date, $start_date, $end_date, $end_date]);
            })
            ->where(function ($q) use ($start_time, $end_time) {
                $q->whereRaw('start_time <= ? and end_time >= ? or start_time <= ? and end_time >= ? ', [$start_time, $start_time, $end_time, $end_time]);
            });

        if (!empty($id)) { // เช็กในกรณีแก้ไข ไม่ให้นับ row ของตัวเอง จะได้หาค่าที่เหลือมกับของคนอื่น
            $rs = $rs->where('id', '<>', $id);
        }

        $rs = $rs->get();
---
select * from `booking_bosses` where `st_boss_id` = '2' and (start_date <= '' and end_date >= '' or start_date <= '' and end_date >= '' ) and (start_time <= '00:00' and end_time >= '00:00' or start_time <= '00:00' and end_time >= '00:00' )

    public function ajaxGetDriver()
    {
        $st_department_code = $_GET['st_department_code'];
        $st_bureau_code = $_GET['st_bureau_code'];
        $st_division_code = $_GET['st_division_code'];

        $rs = StDriver::select('*')->where('status', 1);

        if (!empty($st_department_code)) {
            $rs = $rs->where('st_department_code', $st_department_code);
        }

        if (!empty($st_bureau_code)) {
            $rs = $rs->where('st_bureau_code', $st_bureau_code);
        }

        if (!empty($st_division_code)) {
            $rs = $rs->where('st_division_code', $st_division_code);
        }

        $data['rs'] = $rs->get();
---
select * from `st_drivers` where `status` = 1 and `st_department_code` = '06102' and `st_bureau_code` = '06102048' and `st_division_code` = '06102048001'