app/Http/Controllers/AjaxController.php

    public function ajaxGetRoom()
    {
        $rs = StRoom::select('*')->where('status', '1');

        /**
         * เห็นเฉพาะของตัวเอง ในกรณีที่สิทธิ์การใช้งานตั้งค่าไว้, default คือเห็นทั้งหมด
         */
        if (!Auth::guest()) {
            if (CanPerm('access-self')) {
                $rs = $rs->where('st_division_code', Auth::user()->st_division_code);
            }
        }

        if (!empty($_GET['search'])) {
            $rs = $rs->where('name', 'like', '%' . $_GET['search'] . '%');
        }

        if (!empty($_GET['depertment_code'])) {
            $rs = $rs->where('st_department_code', $_GET['depertment_code']);
        }

        if (!empty($_GET['bureau_code'])) {
            $rs = $rs->where('st_bureau_code', $_GET['bureau_code']);
        }

        $rs = $rs->orderBy('id', 'asc')->get();
---
select * from `st_rooms` where `status` = '1' and `name` like '%Web Developer%' and `st_department_code` = '06101' order by `id` asc