app/Http/Controllers/BookingRoomConferenceController.php

select * from `st_rooms` where `st_rooms`.`id` in (16, 40)
---
    public function store(BookingRoomRequest $request)
    {
        $requestData = $request->all();
        $requestData['start_date'] = Date2DB($request->start_date);
        $requestData['end_date'] = Date2DB($request->end_date);
        if ($requestData['use_conference'] == 1) {
            $requestData['status_conference'] = 'รออนุมัติ';
        }
        $data = BookingRoom::create($requestData);

        // อัพเดทรหัสการจอง โดยเอา ไอดี มาคำนวน
        $rs = BookingRoom::find($data->id);