app/Http/Controllers/BookingRoomController.php

    public function index(Request $request)
    {
        // ตรวจสอบ permission
        ChkPerm('booking-room-view');

        $keyword     = $request->get('search');
        $data_type   = $request->get('date_type');
        $date_select = $request->get('date_select');
        $status      = $request->get('status');
        $perPage     = 10;

        $rs = BookingRoom::filterByPermissionView()
            ->with('st_room.department', 'st_room.bureau', 'st_room.division', 'department', 'bureau', 'division', 'approver.prefix', 'conferenceApprover.prefix')
            ->select('*')->where('use_conference', '<>', 1);

        $rs_all = $rs->get();
---
select * from `booking_rooms` where `use_conference` <> 1

    public function store(BookingRoomRequest $request)
    {
        $requestData               = $request->all();
        $requestData['start_date'] = Date2DB($request->start_date);
        $requestData['end_date']   = Date2DB($request->end_date);
        if ($requestData['use_conference'] == 1) {
            $requestData['status_conference'] = 'รออนุมัติ';
        }

        $data = BookingRoom::create($requestData);

        // อัพเดทรหัสการจอง โดยเอา ไอดี มาคำนวน
        $rs       = BookingRoom::find($data->id);
---
select * from `st_rooms` where `st_rooms`.`id` in (12, 40, 42, 43)

    public function show(Request $request)
    {
        $keyword    = $request->get('search');
        $st_room_id = $request->get('st_room_id');
        $status     = $request->get('status');

        $rs = BookingRoom::filterByPermissionView()
            ->select('*')
            ->where('use_conference', '<>', 1);

        if (!empty($keyword)) {
            $rs = $rs->where(function ($q) use ($keyword) {
                $q->where('code', 'LIKE', "%$keyword%")
                    ->orWhere('title', 'LIKE', "%$keyword%")
                    ->orWhere('request_name', 'LIKE', "%$keyword%");
            });
        }

        if (!empty($status)) {
            $rs = $rs->where('status', $status);
        }

        $rs = $rs->orderBy('id', 'desc')->with('department', 'bureau', 'division', 'st_room')->get();
---
select * from `booking_rooms` where `use_conference` <> 1 order by `id` desc

    public function edit($id)
    {
        // ตรวจสอบ permission
        // ChkPerm('booking-room-edit', 'booking-room');

        $rs = BookingRoom::findOrFail($id);
---
select * from `st_rooms` where `st_rooms`.`id` in (12, 13, 16, 18, 22, 23, 24, 25, 28, 35, 36, 37, 39, 40, 41, 42, 43)

    public function update(BookingRoomRequest $request, $id)
    {
        $requestData               = $request->all();
        $requestData['start_date'] = Date2DB($request->start_date);
        $requestData['end_date']   = Date2DB($request->end_date);

        $rs = BookingRoom::findOrFail($id);
---
select * from `st_rooms` where `st_rooms`.`id` in (12, 13, 16, 18, 22, 23, 24, 25, 28, 35, 36, 37, 39)