app/Http/Controllers/BookingRoomController.php

    public function index(Request $request)
    {
        // ตรวจสอบ permission
        ChkPerm('booking-room-view');

        $keyword = $request->get('search');
        $data_type = $request->get('date_type');
        $date_select = $request->get('date_select');
        $status = $request->get('status');
        $perPage = 10;

        $rs = BookingRoom::with('st_room.department', 'st_room.bureau', 'st_room.division', 'department', 'bureau', 'division', 'approver.prefix', 'conferenceApprover.prefix')->select('*');

        /**
         *  ถ้า user ที่ login นี้ ได้ถูกเลือกเป็นผู้จัดการจองห้อง (Manage booking) ใน setting/st-room ให้แสดงเฉพาะการจองของห้องที่ถูกต้องค่าไว้ โดยไม่สนว่าจะเป็น access-self หรือ access-all
         */
        $is_manageroom = ManageRoom::select('st_room_id')->where('user_id', Auth::user()->id)->get()->toArray();
        // dd($is_manageroom);
        if ($is_manageroom) {
            $rs = $rs->whereIn('st_room_id', $is_manageroom);
        } else {
            /**
             * เห็นเฉพาะห้องที่อยู่ในกลุ่มของตัวเอง ในกรณีที่สิทธิ์การใช้งานตั้งค่าไว้, ถ้าเป็น default คือเห็นทั้งหมด
             */
            if (CanPerm('access-self')) {
                $rs = $rs->whereHas('st_room', function ($q) {
                    $q->where('st_division_code', Auth::user()->st_division_code);
                });
---
select `st_room_id` from `manage_rooms` where `user_id` = 1
select * from `booking_rooms` where exists (select * from `st_rooms` where `booking_rooms`.`st_room_id` = `st_rooms`.`id` and `st_division_code` = '06102048001')
select * from `st_bureaus` where `st_bureaus`.`code` in ('06102004', '06102007', '06102008', '06102009', '06102011', '06102048', '06102084')
select * from `st_departments` where `st_departments`.`code` in ('06102')
select * from `st_divisions` where `st_divisions`.`code` in ('06102004001', '06102007001', '06102007004', '06102008001', '06102009002', '06102011001', '06102011002', '06102011003', '06102048001', '06102084001')

    public function store(BookingRoomRequest $request)
    {
        $requestData = $request->all();
        $requestData['start_date'] = Date2DB($request->start_date);
        $requestData['end_date'] = Date2DB($request->end_date);
        $data = BookingRoom::create($requestData);

        // อัพเดทรหัสการจอง โดยเอา ไอดี มาคำนวน
        $rs = BookingRoom::find($data->id);
---
select * from `st_rooms` where `st_rooms`.`id` in (43)


        $rs_all = $rs->get();

        $rs = $rs->orderBy('id', 'desc')->with('department', 'bureau', 'division', 'st_room')->get();
---
select * from `st_rooms` where `st_rooms`.`id` in (12, 13, 16, 18, 22, 23, 24, 25, 28, 35, 36, 37, 39, 40, 41, 42, 43)