app/Http/Controllers/BookingRoomFrontController.php

    public function show(Request $request)
    {
        $keyword = $request->get('search');
        $st_room_id = $request->get('st_room_id');
        $status = $request->get('status');

        $rs = BookingRoom::select('*');
        $rs_all = $rs->get();

        // ถ้าไม่ได้มาจากช่องค้นหา ให้ select room ตามค่าที่ตั้ง default ไว้ในเมนูตั้งค่าห้อง
        if (!empty($st_room_id)) {
            $rs = $rs->where('st_room_id', $st_room_id);
        } else {
            $rs = $rs->whereHas('st_room', function ($q) {
                $q->where('is_default', 1);
            });
        }

        if (!empty($keyword)) {
            $rs = $rs->where(function ($q) use ($keyword) {
                $q->where('code', 'LIKE', "%$keyword%")
                    ->orWhere('title', 'LIKE', "%$keyword%")
                    ->orWhere('request_name', 'LIKE', "%$keyword%");
            });
        }

        if (!empty($status)) {
            $rs = $rs->where('status', $status);
        }

        $rs = $rs->orderBy('id', 'desc')->get();
---
select * from `st_rooms` where `st_rooms`.`id` in (16)