app/Http/Controllers/BookingRoomConferenceController.php

select `st_room_id` from `manage_rooms` where `user_id` = 1
select * from `booking_rooms` where `use_conference` = 1
select * from `st_bureaus` where `st_bureaus`.`code` in ('06102004', '06102007', '06102011')
select * from `st_departments` where `st_departments`.`code` in ('06102')
select * from `st_divisions` where `st_divisions`.`code` in ('06102004001', '06102007004', '06102011002', '06102011003')
---
    public function index(Request $request)
    {
        // ตรวจสอบ permission
        ChkPerm('booking-room-conference-view');

        $keyword = $request->get('search');
        $data_type = $request->get('date_type');
        $date_select = $request->get('date_select');
        $status = $request->get('status');
        $perPage = 10;

        $rs = BookingRoom::with('st_room.department', 'st_room.bureau', 'st_room.division', 'department', 'bureau', 'division', 'approver.prefix', 'conferenceApprover.prefix')->select('*')->where('use_conference', 1);

        /**
         *  ถ้า user ที่ login นี้ ได้ถูกเลือกเป็นผู้จัดการจองห้อง (Manage booking) ใน setting/st-room ให้แสดงเฉพาะการจองของห้องที่ถูกต้องค่าไว้ โดยไม่สนว่าจะเป็น access-self หรือ access-all
         */
        $is_manageroom = ManageRoom::select('st_room_id')->where('user_id', Auth::user()->id)->get()->toArray();
        // dd($is_manageroom);
        if ($is_manageroom) {
            $rs = $rs->whereIn('st_room_id', $is_manageroom);
        } else {
            /**
             * เห็นเฉพาะห้องที่อยู่ในกลุ่มของตัวเอง ในกรณีที่สิทธิ์การใช้งานตั้งค่าไว้, ถ้าเป็น default คือเห็นทั้งหมด
             */
            if (CanPerm('access-self')) {
                $rs = $rs->whereHas('st_room', function ($q) {
                    $q->where('st_division_code', Auth::user()->st_division_code);
                });

select * from `booking_rooms` where `use_conference` = 1
select * from `booking_rooms` where `use_conference` = 1 order by `id` desc
---
    public function show(Request $request)
    {
        $keyword = $request->get('search');
        $st_room_id = $request->get('st_room_id');
        $status = $request->get('status');

        $rs = BookingRoom::select('*')->where('use_conference', 1);

        // if (!empty($st_room_id)) { // ถ้าไม่ได้มาจากช่องค้นหา ให้ select room ตามค่าที่ตั้ง default ไว้ในเมนูตั้งค่าห้อง
        //     $rs = $rs->where('st_room_id', $st_room_id);
        // } else {
        //     $rs = $rs->whereHas('st_room', function ($q) {
        //         $q->where('is_default', 1);
        //     });
        // }

        if (!empty($keyword)) {
            $rs = $rs->where(function ($q) use ($keyword) {
                $q->where('code', 'LIKE', "%$keyword%")
                    ->orWhere('title', 'LIKE', "%$keyword%")
                    ->orWhere('request_name', 'LIKE', "%$keyword%");
            });
        }

        if (!empty($status)) {
            $rs = $rs->where('status', $status);
        }

        $rs_all = $rs->get();

        $rs = $rs->orderBy('id', 'desc')->with('department', 'bureau', 'division', 'st_room')->get();

select * from `st_rooms` where `st_rooms`.`id` in (16, 25, 28, 40)
---
    public function edit($id)
    {
        // ตรวจสอบ permission
        // ChkPerm('booking-room-edit', 'booking-room');

        $rs = BookingRoom::findOrFail($id);