app/Http/Controllers/BookingVehicleController.php

select * from `booking_vehicles` where `req_st_department_code` = '06102' and `req_st_bureau_code` = '06102048' and `req_st_division_code` = '06102048001'
select * from `st_bureaus` where `st_bureaus`.`code` in ('06101001', '06102002', '06102003', '06102004', '06102005', '06102006', '06102007', '06102008', '06102009', '06102010', '06102011', '06102012', '06102013', '06102048', '06102102', '06103004', '06103005')
select * from `st_departments` where `st_departments`.`code` in ('06101', '06102', '06103')
select * from `st_divisions` where `st_divisions`.`code` in ('06101001001', '06102002001', '06102003001', '06102003002', '06102003003', '06102004001', '06102004003', '06102005001', '06102006001', '06102006002', '06102007001', '06102007004', '06102008001', '06102008002', '06102008003', '06102008004', '06102009001', '06102010001', '06102011001', '06102011003', '06102012003', '06102013001', '06102048002', '06102102001', '06103004001', '06103005023')
select * from `st_bureaus` where `st_bureaus`.`code` in ('06102003', '06102004', '06102048')
select * from `st_departments` where `st_departments`.`code` in ('06102')
select * from `st_divisions` where `st_divisions`.`code` in ('06102003002', '06102004001', '06102048002')
---
    public function index(Request $request)
    {
        // ตรวจสอบ permission
        ChkPerm('booking-vehicle-view');

        $st_vehicle_type_id = $request->get('st_vehicle_type_id');
        $keyword = $request->get('search');
        $data_type = $request->get('date_type');
        $date_select = $request->get('date_select');
        $status = $request->get('status');
        $perPage = 10;

        $rs = BookingVehicle::with('st_vehicle', 'st_driver', 'department', 'bureau', 'division')->select('*');

        /**
         * เห็นเฉพาะของตัวเอง ในกรณีที่สิทธิ์การใช้งานตั้งค่าไว้, default คือเห็นทั้งหมด
         * เห็นเฉพาะยานพาหนะที่อยู่ในสังกัดของตัวเอง
         */
        if (CanPerm('access-self')) {
            // $rs = $rs->whereHas('st_vehicle', function($q){
            //     $q->where('st_division_code',Auth::user()->st_division_code);
            // });

            $rs = $rs->where('req_st_department_code', Auth::user()->st_department_code)
                ->where('req_st_bureau_code', Auth::user()->st_bureau_code)
                ->where('req_st_division_code', Auth::user()->st_division_code);
        }
        $rs_all = $rs->get();

select * from `booking_vehicles`
---
    public function show(Request $request)
    {
        $keyword = $request->get('search');
        $st_room_id = $request->get('st_vehicle_id');
        $st_department_code = $request->get('st_department_code');
        $st_bureau_code = $request->get('st_bureau_code');
        $st_division_code = $request->get('st_division_code');
        $status = $request->get('status');

        $rs = BookingVehicle::select('*');
        $rs_all = $rs->get();

select * from `st_vehicle_types` where `st_vehicle_types`.`id` in (8)
select * from `st_vehicles` where `st_vehicles`.`id` in (41)
---
            $rs = $rs->where('status', $status);
        }

        $rs = $rs->orderBy('id', 'desc')->with('st_vehicle.st_vehicle_type')->get();

select * from `st_vehicles` where `st_vehicles`.`id` in (41)
---
    public function update(BookingVehicleRequest $request, $id)
    {
        $requestData = $request->all();
        $requestData['request_date'] = Date2DB($request->request_date);
        $requestData['start_date'] = Date2DB($request->start_date);
        $requestData['end_date'] = Date2DB($request->end_date);
        $requestData['approve_by_id'] = Auth::user()->id;
        $requestData['approve_date'] = date('Y-m-d H:i:s');

        $rs = BookingVehicle::findOrFail($id);