app/Http/Controllers/BookingVehicleFrontController.php

    public function show(Request $request)
    {
        $keyword = $request->get('search');
        $st_room_id = $request->get('st_vehicle_id');
        $st_department_code = $request->get('st_department_code');
        $st_bureau_code = $request->get('st_bureau_code');
        $st_division_code = $request->get('st_division_code');
        $status = $request->get('status');
        $st_province_code = $request->get('st_province_code');
        $req_st_bureau_code = $request->get('req_st_bureau_code');

        $rs = BookingVehicle::select('*');
        $rs_all = $rs->get();
---
select * from `booking_vehicles`

            $rs = $rs->where('req_st_bureau_code', $req_st_bureau_code);
        }

        $rs = $rs->orderBy('id', 'desc')->with('st_vehicle.st_vehicle_type')->get();
---
select * from `st_vehicle_types` where `st_vehicle_types`.`id` in (5, 6, 7, 8)
select * from `st_vehicles` where `st_vehicles`.`id` in ('', 6, 7, 10, 11, 12, 13, 15, 18, 19, 21, 22, 23, 24, 27, 30, 31, 33, 35, 37, 41)