app/Http/Controllers/BookingBossFrontController.php

    public function summary($id)
    {
        $rs = BookingBoss::findOrFail($id);
---
select * from `st_bosses` where `st_bosses`.`id` in (1, 2, 3, 4, 15)

    public function genCode($rs)
    {
        // อัพเดทรหัสการจอง โดยเอา ไอดี มาคำนวน
        $rs = BookingBoss::find($rs->id);
        $rs->code = 'BS' . sprintf("%05d", $rs->id);
        $rs->save();
---
update `booking_bosses` set `code` = 'BS00048', `booking_bosses`.`updated_at` = '2021-04-20 11:01:26' where `id` = 48