app/Http/Controllers/BookingRoomFrontController.php

    public function store(BookingRoomRequest $request)
    {
        $requestData = $request->all();
        $requestData['start_date'] = Date2DB($request->start_date);
        $requestData['end_date'] = Date2DB($request->end_date);
        $requestData['status'] = 'รออนุมัติ';
        if ($requestData['use_conference'] == 1) {
            $requestData['status_conference'] = 'รออนุมัติ';
        }
        $data = BookingRoom::create($requestData);

        // อัพเดทรหัสการจอง โดยเอา ไอดี มาคำนวน
        $rs = BookingRoom::find($data->id);
        $rs->code = 'RR' . sprintf("%05d", $data->id);
        $rs->save();
---
update `booking_rooms` set `code` = 'RR01119', `booking_rooms`.`updated_at` = '2021-04-20 15:09:43' where `id` = 1119

    public function show(Request $request)
    {
        $keyword = $request->get('search');
        $st_room_id = $request->get('st_room_id');
        $status = $request->get('status');
        $st_province_id = $request->get('st_province_id');

        $rs = BookingRoom::with('department', 'bureau', 'division', 'st_room');
        $rs_all = $rs->get();
---
select * from `booking_rooms`
select * from `st_rooms` where `st_rooms`.`id` in (12, 13, 14, 16, 17, 18, 19, 21, 22, 23, 24, 25, 26, 28, 35, 36, 37, 39, 40, 41, 42, 43)

    public function summary($id)
    {
        $rs = BookingRoom::findOrFail($id);
---
select * from `st_rooms` where `st_rooms`.`id` in (13)